* Doyle 2018
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta


** Temperature

** Thickness

From Doyle (2018), "Ice thickness at S30 was determined to be ∼600 m"

** Location

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC jupyter-python :exports none
import pandas as pd

url = 'https://figshare.com/ndownloader/files/10115730'
df = pd.read_csv(url, skiprows=11, usecols=(1,2), index_col=0).rename(columns={'T_final':'t'})
df.index.name = 'd'
df.to_csv('data.csv', float_format='%.3f')
#+END_SRC

#+RESULTS:


#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|       d |       t |
| 101.735 |  -14.48 |
| 201.595 | -17.949 |
| 302.005 | -21.202 |
| 401.865 | -18.805 |
| 451.835 | -18.959 |
| 501.935 | -14.123 |
| 551.605 |  -5.913 |
| 591.545 |  -1.154 |
| 596.525 |  -0.778 |
| 600.505 |  -0.704 |
| 604.271 |  -0.629 |


